//算术运算和逻辑运算
//====

#include <stdio.h>


unsigned int 	x = 0x1A;	//0000 0000 0000 0000 0000 0000 0001 1010
int 		y = -10;	//1111 1111 1111 1111 1111 1111 1111 0110  -> -10
				//0000 0000 0000 0000 0000 0000 0000 1010  ->  10
				//
unsigned int z = 0xFFFFFFF0;

void main(){
	
//	x = x >> 1;	// 0001 1010 -> 0000 1101 (D)
//	x = x << 3;	// 0001 1010 -> 1101 0000 (D)
//	printf("x = 0x%x\n",x);

//	y = y >> 1;	//  1111 1111 1111 1111 1111 1111 1111 1011 FFFFFFFB 右移运算, 符号位用符号填充 最高位补1
//	y = y << 2;	//  1111 1111 1111 1111 1111 1111 1101 1000 FFFFFFD8 左移移运算
//	printf("y = 0x%x\n",y);
	z = z >> 1;	//7FFF FFF8 最高位补0
	printf("z = 0x%x\n",z);

}
